/****************************************************************************************************************************
*
*   文 件 名 ： md.h 
*   文件描述 ：  
*   创建日期 ：2019年5月13日
*   版本号 ：   
*   负责人 ： Zhangsheng 
*   其 他 ：
*   修改日志 ：
*
****************************************************************************************************************************/

#ifndef __MD_H__
#define __MD_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*---------------------------------外部变量说明---------------------------------*/





/*---------------------------------外部函数原型说明---------------------------------*/





/*---------------------------------内部函数原型说明---------------------------------*/





/*---------------------------------全局变量---------------------------------*/





/*---------------------------------模块级变量---------------------------------*/





/*---------------------------------常量定义---------------------------------*/





/*---------------------------------宏定义---------------------------------*/
#define MD4_CKSUM 0X01
#define MD5_CKSUM 0X02
 
typedef unsigned char md_t[16];

#pragma pack(1)


#pragma pack()

 unsigned char * md_sum(int mdType, const unsigned char * data, int len, md_t output);
 int md_check(int mdType, const unsigned char * data, int len, const md_t md4sum);


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __MD_H__ */
