/****************************************************************************************************************************
*
*   文 件 名 ： sha.h 
*   文件描述 ：  
*   创建日期 ：2019年5月13日
*   版本号 ：   
*   负责人 ： Zhangsheng 
*   其 他 ：
*   修改日志 ：
*
****************************************************************************************************************************/

#ifndef __SHA_H__
#define __SHA_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*---------------------------------外部变量说明---------------------------------*/





/*---------------------------------外部函数原型说明---------------------------------*/





/*---------------------------------内部函数原型说明---------------------------------*/





/*---------------------------------全局变量---------------------------------*/





/*---------------------------------模块级变量---------------------------------*/





/*---------------------------------常量定义---------------------------------*/





/*---------------------------------宏定义---------------------------------*/
#define SHA_CKSUM 0X00
#define SHA1_CKSUM 0X01
#define SHA224_CKSUM 0X02
#define SHA256_CKSUM 0X03
#define SHA384_CKSUM 0X04
#define SHA512_CKSUM 0X05

typedef unsigned char sha_t[128];

#pragma pack(1)

#pragma pack()

 int sha_check(int shaType, const unsigned char * data, int len, const sha_t shasum);
 unsigned char * sha_sum(int shaType, const unsigned char * data, int len, sha_t output);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __SHA_H__ */
