/****************************************************************************************************************************
*
*   文 件 名 ： zstdcompress.h 
*   文件描述 ：使用zstd算法进行数据压缩的模块功能接口头文件  
*   创建日期 ：2018年9月13日
*   版本号 ： 
*   负责人 ： Zhangsheng 
*   其 他 ：
*   修改日志 ：
*
****************************************************************************************************************************/

#ifndef __ZSTDCOMPRESS_H__
#define __ZSTDCOMPRESS_H__

#include "zstdlib.h"
#include "../../../baselib/baselib.h"

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

/*---------------------------------外部变量说明---------------------------------*/




/*---------------------------------外部函数原型说明---------------------------------*/




/*---------------------------------内部函数原型说明---------------------------------*/




/*---------------------------------全局变量---------------------------------*/




/*---------------------------------模块级变量---------------------------------*/




/*---------------------------------常量定义---------------------------------*/




/*---------------------------------宏定义---------------------------------*/




#pragma pack(1)




#pragma pack()

 int zstd_compress_data(BYTE * databuff, int datasize, BYTE level);
 int zstd_decompress_data(BYTE * databuff, int datasize, int minlen);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __ZSTDCOMPRESS_H__ */
