/****************************************************************************************************************************
*
*   文 件 名 ： sharedmem.h 
*   文件描述 ：  
*   创建日期 ：2019年4月11日
*   版本号 ：   
*   负责人 ： Zhangsheng 
*   其 他 ：
*   修改日志 ：
*
****************************************************************************************************************************/

#ifndef __SHAREDMEM_H__
#define __SHAREDMEM_H__

#include "../baselib/baselib.h"


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*---------------------------------外部变量说明---------------------------------*/





/*---------------------------------外部函数原型说明---------------------------------*/





/*---------------------------------内部函数原型说明---------------------------------*/





/*---------------------------------全局变量---------------------------------*/





/*---------------------------------模块级变量---------------------------------*/





/*---------------------------------常量定义---------------------------------*/





/*---------------------------------宏定义---------------------------------*/

#define MM_MODE (PROT_READ | PROT_WRITE)
#define MM_FLAGS (MAP_SHARED | MAP_ANONYMOUS)

#pragma pack(1)

#pragma pack()

 void * sharedmem_malloc(int mSize);
 void sharedmem_release(void * pSharedmem, int mSize);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __SHAREDMEM_H__ */
