/****************************************************************************************************************************
*
*   文 件 名 ： bz2compress.h 
*   文件描述 ：VOI使用BZ2算法进行数据压缩的模块功能接口头文件  
*   创建日期 ：2018年9月13日
*   版本号 ： 9.7.2.0.1 
*   负责人 ： Zhangsheng 
*   其 他 ：
*   修改日志 ：
*
****************************************************************************************************************************/

#ifndef __BZ2COMPRESS_H__
#define __BZ2COMPRESS_H__

#include "../../../baselib/baselib.h"

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

/*---------------------------------外部变量说明---------------------------------*/




/*---------------------------------外部函数原型说明---------------------------------*/




/*---------------------------------内部函数原型说明---------------------------------*/




/*---------------------------------全局变量---------------------------------*/




/*---------------------------------模块级变量---------------------------------*/




/*---------------------------------常量定义---------------------------------*/




/*---------------------------------宏定义---------------------------------*/




#pragma pack(1)




#pragma pack()

 int bz2_compress_data(BYTE * databuff, int datasize, int blocksize100k, int verbosity, int workfactor);
 int bz2_decompress_data(BYTE * databuff, int datasize, int minlen);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __BZ2COMPRESS_H__ */
